Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1064DAS176.atdf
         <register caption="" name="GLCDCURDATA45" offset="0x8B4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1115" />
            <bitfield mask="0x000000F0" name="PIXEL1114" />
            <bitfield mask="0x00000F00" name="PIXEL1113" />
            <bitfield mask="0x0000F000" name="PIXEL1112" />
            <bitfield mask="0x000F0000" name="PIXEL1111" />
            <bitfield mask="0x00F00000" name="PIXEL1110" />
            <bitfield mask="0x0F000000" name="PIXEL119" />
            <bitfield mask="0xF0000000" name="PIXEL118" />
         </register>
         <register caption="" name="GLCDCURDATA46" offset="0x8B8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1123" />
            <bitfield mask="0x000000F0" name="PIXEL1122" />
            <bitfield mask="0x00000F00" name="PIXEL1121" />
            <bitfield mask="0x0000F000" name="PIXEL1120" />
            <bitfield mask="0x000F0000" name="PIXEL1119" />
            <bitfield mask="0x00F00000" name="PIXEL1118" />
            <bitfield mask="0x0F000000" name="PIXEL1117" />
            <bitfield mask="0xF0000000" name="PIXEL1116" />
         </register>
         <register caption="" name="GLCDCURDATA47" offset="0x8BC" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1131" />
            <bitfield mask="0x000000F0" name="PIXEL1130" />
            <bitfield mask="0x00000F00" name="PIXEL1129" />
            <bitfield mask="0x0000F000" name="PIXEL1128" />
            <bitfield mask="0x000F0000" name="PIXEL1127" />
            <bitfield mask="0x00F00000" name="PIXEL1126" />
            <bitfield mask="0x0F000000" name="PIXEL1125" />
            <bitfield mask="0xF0000000" name="PIXEL1124" />
         </register>
         <register caption="" name="GLCDCURDATA48" offset="0x8C0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL127" />
            <bitfield mask="0x000000F0" name="PIXEL126" />
            <bitfield mask="0x00000F00" name="PIXEL125" />
            <bitfield mask="0x0000F000" name="PIXEL124" />
            <bitfield mask="0x000F0000" name="PIXEL123" />
            <bitfield mask="0x00F00000" name="PIXEL122" />
            <bitfield mask="0x0F000000" name="PIXEL121" />
            <bitfield mask="0xF0000000" name="PIXEL120" />
         </register>
         <register caption="" name="GLCDCURDATA49" offset="0x8C4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1215" />
            <bitfield mask="0x000000F0" name="PIXEL1214" />
            <bitfield mask="0x00000F00" name="PIXEL1213" />
            <bitfield mask="0x0000F000" name="PIXEL1212" />
            <bitfield mask="0x000F0000" name="PIXEL1211" />
            <bitfield mask="0x00F00000" name="PIXEL1210" />
            <bitfield mask="0x0F000000" name="PIXEL129" />
            <bitfield mask="0xF0000000" name="PIXEL128" />
         </register>
         <register caption="" name="GLCDCURDATA50" offset="0x8C8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1223" />
            <bitfield mask="0x000000F0" name="PIXEL1222" />
            <bitfield mask="0x00000F00" name="PIXEL1221" />
            <bitfield mask="0x0000F000" name="PIXEL1220" />
            <bitfield mask="0x000F0000" name="PIXEL1219" />
            <bitfield mask="0x00F00000" name="PIXEL1218" />
            <bitfield mask="0x0F000000" name="PIXEL1217" />
            <bitfield mask="0xF0000000" name="PIXEL1216" />
         </register>
         <register caption="" name="GLCDCURDATA51" offset="0x8CC" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1231" />
            <bitfield mask="0x000000F0" name="PIXEL1230" />
            <bitfield mask="0x00000F00" name="PIXEL1229" />
            <bitfield mask="0x0000F000" name="PIXEL1228" />
            <bitfield mask="0x000F0000" name="PIXEL1227" />
            <bitfield mask="0x00F00000" name="PIXEL1226" />
            <bitfield mask="0x0F000000" name="PIXEL1225" />
            <bitfield mask="0xF0000000" name="PIXEL1224" />
         </register>
         <register caption="" name="GLCDCURDATA52" offset="0x8D0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL137" />
            <bitfield mask="0x000000F0" name="PIXEL136" />
            <bitfield mask="0x00000F00" name="PIXEL135" />
            <bitfield mask="0x0000F000" name="PIXEL134" />
            <bitfield mask="0x000F0000" name="PIXEL133" />
            <bitfield mask="0x00F00000" name="PIXEL132" />
            <bitfield mask="0x0F000000" name="PIXEL131" />
            <bitfield mask="0xF0000000" name="PIXEL130" />
         </register>
         <register caption="" name="GLCDCURDATA53" offset="0x8D4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1315" />
            <bitfield mask="0x000000F0" name="PIXEL1314" />
            <bitfield mask="0x00000F00" name="PIXEL1313" />
            <bitfield mask="0x0000F000" name="PIXEL1312" />
            <bitfield mask="0x000F0000" name="PIXEL1311" />
            <bitfield mask="0x00F00000" name="PIXEL1310" />
            <bitfield mask="0x0F000000" name="PIXEL139" />
            <bitfield mask="0xF0000000" name="PIXEL138" />
         </register>
         <register caption="" name="GLCDCURDATA54" offset="0x8D8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1323" />
            <bitfield mask="0x000000F0" name="PIXEL1322" />
            <bitfield mask="0x00000F00" name="PIXEL1321" />
            <bitfield mask="0x0000F000" name="PIXEL1320" />
            <bitfield mask="0x000F0000" name="PIXEL1319" />
            <bitfield mask="0x00F00000" name="PIXEL1318" />
            <bitfield mask="0x0F000000" name="PIXEL1317" />
            <bitfield mask="0xF0000000" name="PIXEL1316" />
         </register>
         <register caption="" name="GLCDCURDATA55" offset="0x8DC" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL1331" />
            <bitfield mask="0x000000F0" name="PIXEL1330" />
            <bitfield mask="0x00000F00" name="PIXEL1329" />
            <bitfield mask="0x0000F000" name="PIXEL1328" />
            <bitfield mask="0x000F0000" name="PIXEL1327" />
            <bitfield mask="0x00F00000" name="PIXEL1326" />
            <bitfield mask="0x0F000000" name="PIXEL1325" />
            <bitfield mask="0xF0000000" name="PIXEL1324" />
         </register>
         <register caption="" name="GLCDCURDATA56" offset="0x8E0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL147" />
            <bitfield mask="0x000000F0" name="PIXEL146" />
            <bitfield mask="0x00000F00" name="PIXEL145" />
            <bitfield mask="0x0000F000" name="PIXEL144" />
            <bitfield mask="0x000F0000" name="PIXEL143" />
            <bitfield mask="0x00F00000" name="PIXEL142" />
            <bitfield mask="0x0F000000" name="PIXEL141" />
            <bitfield mask="0xF0000000" name="PIXEL140" />
         </register>
