Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1064DAS176.atdf
         <register caption="" name="TRISH" offset="0x710" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISH0" />
            <bitfield mask="0x00000002" name="TRISH1" />
            <bitfield mask="0x00000004" name="TRISH2" />
            <bitfield mask="0x00000008" name="TRISH3" />
            <bitfield mask="0x00000010" name="TRISH4" />
            <bitfield mask="0x00000020" name="TRISH5" />
            <bitfield mask="0x00000040" name="TRISH6" />
            <bitfield mask="0x00000080" name="TRISH7" />
            <bitfield mask="0x00000100" name="TRISH8" />
            <bitfield mask="0x00000200" name="TRISH9" />
            <bitfield mask="0x00000400" name="TRISH10" />
            <bitfield mask="0x00000800" name="TRISH11" />
            <bitfield mask="0x00001000" name="TRISH12" />
            <bitfield mask="0x00002000" name="TRISH13" />
            <bitfield mask="0x00004000" name="TRISH14" />
            <bitfield mask="0x00008000" name="TRISH15" />
         </register>
         <register caption="" name="TRISJ" offset="0x810" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISJ0" />
            <bitfield mask="0x00000002" name="TRISJ1" />
            <bitfield mask="0x00000004" name="TRISJ2" />
            <bitfield mask="0x00000008" name="TRISJ3" />
            <bitfield mask="0x00000010" name="TRISJ4" />
            <bitfield mask="0x00000020" name="TRISJ5" />
            <bitfield mask="0x00000040" name="TRISJ6" />
            <bitfield mask="0x00000080" name="TRISJ7" />
            <bitfield mask="0x00000100" name="TRISJ8" />
            <bitfield mask="0x00000200" name="TRISJ9" />
            <bitfield mask="0x00000400" name="TRISJ10" />
            <bitfield mask="0x00000800" name="TRISJ11" />
            <bitfield mask="0x00001000" name="TRISJ12" />
            <bitfield mask="0x00002000" name="TRISJ13" />
            <bitfield mask="0x00004000" name="TRISJ14" />
            <bitfield mask="0x00008000" name="TRISJ15" />
         </register>
         <register caption="" name="TRISK" offset="0x910" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISK0" />
            <bitfield mask="0x00000002" name="TRISK1" />
            <bitfield mask="0x00000004" name="TRISK2" />
            <bitfield mask="0x00000008" name="TRISK3" />
            <bitfield mask="0x00000010" name="TRISK4" />
            <bitfield mask="0x00000020" name="TRISK5" />
            <bitfield mask="0x00000040" name="TRISK6" />
            <bitfield mask="0x00000080" name="TRISK7" />
         </register>
         <register caption="" name="PORTA" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RA0" />
            <bitfield mask="0x00000002" name="RA1" />
            <bitfield mask="0x00000004" name="RA2" />
            <bitfield mask="0x00000008" name="RA3" />
            <bitfield mask="0x00000010" name="RA4" />
            <bitfield mask="0x00000020" name="RA5" />
            <bitfield mask="0x00000040" name="RA6" />
            <bitfield mask="0x00000080" name="RA7" />
            <bitfield mask="0x00000200" name="RA9" />
            <bitfield mask="0x00000400" name="RA10" />
            <bitfield mask="0x00004000" name="RA14" />
            <bitfield mask="0x00008000" name="RA15" />
         </register>
         <register caption="" name="PORTB" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RB0" />
            <bitfield mask="0x00000002" name="RB1" />
            <bitfield mask="0x00000004" name="RB2" />
            <bitfield mask="0x00000008" name="RB3" />
            <bitfield mask="0x00000010" name="RB4" />
            <bitfield mask="0x00000020" name="RB5" />
            <bitfield mask="0x00000040" name="RB6" />
            <bitfield mask="0x00000080" name="RB7" />
            <bitfield mask="0x00000100" name="RB8" />
            <bitfield mask="0x00000200" name="RB9" />
            <bitfield mask="0x00000400" name="RB10" />
            <bitfield mask="0x00000800" name="RB11" />
            <bitfield mask="0x00001000" name="RB12" />
            <bitfield mask="0x00002000" name="RB13" />
            <bitfield mask="0x00004000" name="RB14" />
            <bitfield mask="0x00008000" name="RB15" />
         </register>
         <register caption="" name="PORTC" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x00000002" name="RC1" />
            <bitfield mask="0x00000004" name="RC2" />
            <bitfield mask="0x00000008" name="RC3" />
            <bitfield mask="0x00000010" name="RC4" />
            <bitfield mask="0x00001000" name="RC12" />
            <bitfield mask="0x00002000" name="RC13" />
            <bitfield mask="0x00004000" name="RC14" />
            <bitfield mask="0x00008000" name="RC15" />
         </register>
         <register caption="" name="PORTD" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RD0" />
            <bitfield mask="0x00000002" name="RD1" />
            <bitfield mask="0x00000004" name="RD2" />
            <bitfield mask="0x00000008" name="RD3" />
            <bitfield mask="0x00000010" name="RD4" />
            <bitfield mask="0x00000020" name="RD5" />
            <bitfield mask="0x00000040" name="RD6" />
            <bitfield mask="0x00000080" name="RD7" />
            <bitfield mask="0x00000200" name="RD9" />
            <bitfield mask="0x00000400" name="RD10" />
            <bitfield mask="0x00000800" name="RD11" />
            <bitfield mask="0x00001000" name="RD12" />
            <bitfield mask="0x00002000" name="RD13" />
            <bitfield mask="0x00004000" name="RD14" />
            <bitfield mask="0x00008000" name="RD15" />
         </register>
         <register caption="" name="PORTE" offset="0x420" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RE0" />
            <bitfield mask="0x00000002" name="RE1" />
            <bitfield mask="0x00000004" name="RE2" />
            <bitfield mask="0x00000008" name="RE3" />
            <bitfield mask="0x00000010" name="RE4" />
            <bitfield mask="0x00000020" name="RE5" />
            <bitfield mask="0x00000040" name="RE6" />
            <bitfield mask="0x00000080" name="RE7" />
            <bitfield mask="0x00000100" name="RE8" />
            <bitfield mask="0x00000200" name="RE9" />
         </register>
