Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1064DAS176.atdf
         <register caption="I2C Status Register" name="I2C1STAT" offset="0x10" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C1STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C1STAT__RBF" />
            <bitfield caption="Read/Write Information bit" mask="0x00000004" name="R_W" values="I2C1STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C1STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C1STAT__P" />
            <bitfield caption="Data/Address bit" mask="0x00000020" name="D_A" values="I2C1STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C1STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C1STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C1STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C1STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C1STAT__BCL" />
            <bitfield caption="Acknowledge Time Status bit" mask="0x00002000" name="ACKTIM" values="I2C1STAT__ACKTIM" />
            <bitfield caption="Transmit Status bit" mask="0x00004000" name="TRSTAT" values="I2C1STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit" mask="0x00008000" name="ACKSTAT" values="I2C1STAT__ACKSTAT" />
         </register>
         <register caption="I2C Status Register" name="I2C2STAT" offset="0x210" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C2STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C2STAT__RBF" />
            <bitfield caption="Read/Write Information bit" mask="0x00000004" name="R_W" values="I2C2STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C2STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C2STAT__P" />
            <bitfield caption="Data/Address bit" mask="0x00000020" name="D_A" values="I2C2STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C2STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C2STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C2STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C2STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C2STAT__BCL" />
            <bitfield caption="Acknowledge Time Status bit" mask="0x00002000" name="ACKTIM" values="I2C2STAT__ACKTIM" />
            <bitfield caption="Transmit Status bit" mask="0x00004000" name="TRSTAT" values="I2C2STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit" mask="0x00008000" name="ACKSTAT" values="I2C2STAT__ACKSTAT" />
         </register>
         <register caption="I2C Status Register" name="I2C3STAT" offset="0x410" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C3STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C3STAT__RBF" />
            <bitfield caption="Read/Write Information bit" mask="0x00000004" name="R_W" values="I2C3STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C3STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C3STAT__P" />
            <bitfield caption="Data/Address bit" mask="0x00000020" name="D_A" values="I2C3STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C3STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C3STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C3STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C3STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C3STAT__BCL" />
            <bitfield caption="Acknowledge Time Status bit" mask="0x00002000" name="ACKTIM" values="I2C3STAT__ACKTIM" />
            <bitfield caption="Transmit Status bit" mask="0x00004000" name="TRSTAT" values="I2C3STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit" mask="0x00008000" name="ACKSTAT" values="I2C3STAT__ACKSTAT" />
         </register>
         <register caption="I2C Status Register" name="I2C4STAT" offset="0x610" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C4STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C4STAT__RBF" />
            <bitfield caption="Read/Write Information bit" mask="0x00000004" name="R_W" values="I2C4STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C4STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C4STAT__P" />
            <bitfield caption="Data/Address bit" mask="0x00000020" name="D_A" values="I2C4STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C4STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C4STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C4STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C4STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C4STAT__BCL" />
            <bitfield caption="Acknowledge Time Status bit" mask="0x00002000" name="ACKTIM" values="I2C4STAT__ACKTIM" />
            <bitfield caption="Transmit Status bit" mask="0x00004000" name="TRSTAT" values="I2C4STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit" mask="0x00008000" name="ACKSTAT" values="I2C4STAT__ACKSTAT" />
         </register>
         <register caption="I2C Status Register" name="I2C5STAT" offset="0x810" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C5STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C5STAT__RBF" />
            <bitfield caption="Read/Write Information bit" mask="0x00000004" name="R_W" values="I2C5STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C5STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C5STAT__P" />
            <bitfield caption="Data/Address bit" mask="0x00000020" name="D_A" values="I2C5STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C5STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C5STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C5STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C5STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C5STAT__BCL" />
            <bitfield caption="Acknowledge Time Status bit" mask="0x00002000" name="ACKTIM" values="I2C5STAT__ACKTIM" />
            <bitfield caption="Transmit Status bit" mask="0x00004000" name="TRSTAT" values="I2C5STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit" mask="0x00008000" name="ACKSTAT" values="I2C5STAT__ACKSTAT" />
         </register>
